[
  {
    "orderIndex": 1,
    "name": "Built To Fail",
    "bandAbbrv": "asob",
    "year": 1998,
    "ep": false
  },
  {
    "orderIndex": 2,
    "name": "Pornocracy",
    "bandAbbrv": "asob",
    "year": 2000,
    "ep": false
  },
  {
    "orderIndex": 3,
    "name": "The Apology",
    "bandAbbrv": "asob",
    "year": 2001,
    "ep": true
  },
  {
    "orderIndex": 4,
    "name": "All The Little Ones Are Rotting",
    "bandAbbrv": "asob",
    "year": 2002,
    "ep": true
  },
  {
    "orderIndex": 5,
    "name": "This Is What You Get",
    "bandAbbrv": "asob",
    "year": 2003,
    "ep": false
  },
  {
    "orderIndex": 6,
    "name": "Three Cheers For Disappointment",
    "bandAbbrv": "asob",
    "year": 2006,
    "ep": false
  },
  {
    "orderIndex": 1,
    "name": "Album Minus Band",
    "description": "\"Album Minus Band\" by Bomb the Music Industry! is a groundbreaking release that emerged in 2004, representing a bold departure from conventional album production. Led by the creative force of Jeff Rosenstock, the album was recorded entirely in isolation, with Rosenstock playing every instrument himself. This DIY approach not only demonstrated his multi-instrumental prowess but also embodied the band's commitment to challenging industry norms. The result is a raw and intimate collection of songs that captures the essence of punk and indie rock, with lyrics reflecting themes of introspection, frustration, and the human experience. \"Album Minus Band\" stands as a testament to Bomb the Music Industry!'s ethos of creative freedom, setting the stage for their influential role in shaping the landscape of independent and alternative music.",
    "explanation": "The grand scheme of this whole thing happened as it was being written/recorded. I realized that a lot of ideas that I have never happen because I can't think of a good way to write them down. Then after I DO write them down, I don't remember EXACTLY how I thought they should go so I can give them to the other people I'm in a band with. When The Arrogant Sons of Bitches went on hiatus, I no longer had a band. For a while this made me think \"well, I have no reason to write music 'cause who's gonna play it.\" After giving up for a couple of months, I started working on a few cover songs including Harvey Danger's \"Pike St. - Park Slope.\" It was a lot of fun to take someone else's ideas and try and make them my own, and since those songs were already on other records I could play around with them and make my own versions and stuff and even if it sucked there was already far better versions of these songs elsewhere. The ideas I came up with rarely sounded like those songs that I was actually covering and I started taking those ideas and putting them into my own songs with my own chords and words. Then one day I was sitting in my bedroom and I thought of the \"I'm checkin' out\" line in \"Sweet Home Cananada.\" and I liked it a LOT and didn't want to forget it, so I recorded it on my computer with Garageband and the 'internal microphone' which is located SOMEWHERE that I don't know. I really liked it, played it for some people and they liked it too. I already knew I kinda wanted to start a band based on certain ideas, but now I had a song to do it with too. After that, I started recording every idea I had, 60% of them were good. Eventually they slowly and surely became songs. These recordings were mostly done in a bedroom with a Powerbook computer, MBox, ProTools and a one-hundred dollar microphone called the Oktava MK-319 (except for \"sweet home cananada which was recorded on the Powerbook's internal microphone) . Some vocals were recorded at the Fad's practice space so I didn't have to piss off my neighbors by cursing as loudly as possible well past dinnertime. I also inclued \"Future 86\" which was a song I recorded last summer in my bedroom with a SM-58 and Cool Edit. Also, there are backing vocals on that by The Arrogant Sons of Bitches (recorded in a van), The Know How and around 100 kids in a barn in Massachusettes.",
    "bandAbbrv": "btmi",
    "year": 2006,
    "ep": false,
    "songs": [
      {
        "orderIndex": 1,
        "name": "Blow Your Brains Out on Live TV!!!",
        "youtubeUrl": "https://www.youtube.com/embed/XAmTr5cyII8",
        "lyrics": "[Verse 1]\nWe've got all kinds of problems\nWith the state of the world\nBut there's just one solution\nThat'll get you the girls\n\n[Chorus 1]\nWoah-oh-oh-oh\nBlow your brains out on live TV!\nWoah-oh-oh-oh\nFour more years? Yeah right!\n\n[Verse 2]\nGet a song written about you\nBy a band like Filter\nAnd you'll become a staple\nAt the MT&R\n\n[Chorus 2]\nWoah-oh-oh-oh\nBlow your brains out on live TV!\nWoah-oh-oh-oh\nBlow your brains out, do it, do it!\n\n[Outro]\nWho cares? Not me!\nWho cares? Not me!\nWho cares? Not me!\nFour more years? Yeah right!\n",
        "explanation": "The two hardcore songs on the album are both revolved around a string of thoughts I had on the subway, possibly while drunk. I had written a lot of songs while I lived in Manhattan while riding subway trains or walking around and while they generally sucked, I could always salvage some of the melodies and make them into different better songs. Anyway, I hadn't been in New York for a real long time and I had scrawled down a bunch of notes/chords and the words \"Blow Your Brains Out on Live TV!!!\" All that stuff didn't really work together, so I took that chorus and added it to a song that I wrote in my girlfriend's basement in Buffalo during the five minutes that I decided I wanted to have a strictly 80's hardcore band. This was around the time that Bush got re-elected and that guy killed himself at the WTC site and I thought that was a bold protest statement for whatever reason. So I was in the shower and I was thinking about Bud Dwyer and the infamous moment when he killed himself in front of Congress or whoever it was and how he's famous now. Fox was saying \"some stupid protester kills himself because of Bush and disgraces 9/11\" which I always think is bullshit. I was in the shower thinking about this and thought about \"Hey Man Nice Shot\" which I believe is about that dude and how when I went to school, we visited the Museum of Television and Radio and they talked about crazy shit like that which gets televised. The point of this story is that name-checking Filter and the Museum of Television and Radio in the same sentence is one of the only things I've ever written that I look at people and say \"see... see... i can be funny too\" with my eyes.",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-blow-your-brains-out-on-live-tv-lyrics"
      },
      {
        "orderIndex": 2,
        "name": "Does Your Face Hurt No 'Cause It's Killin' Me!!!",
        "youtubeUrl": "https://www.youtube.com/embed/La_SGlqy21U",
        "lyrics": "Take a look at your haircut, you're killing me\nTake a look at your glasses, you're killing me\nPlacement of the piercings, you're killing me\nFight, fight, fight, fight, fight, fight, fight, fight\n\nTake a look at your ripped jeans, you're killing me\nTake a look at your Converse, you're killing me\nGet a shirt that fits you, you're killing me\nFight, fight, fight, fight, fight, fight, fight, fight\n\nSomeone the other day was telling me about marketing\nAnd how it's so important for a band to sell a t-shirt\nI told him that the money goes right back into the same thing\nAnd now we're just a breeding ground for more and more consumers\n\nSellout, shmellout, it's not about that\nBut all my problems seem to stem from cash\nI got my beliefs and I don't care if they're right\nBut if we don't meet our quota, man, we're gonna get into another fight\n\nSoon we'll be in the clear when we get out of here\nWhere style is function and our egos make us fight\nFor now we'll live in fear, we're not sexy enough for this atmosphere\nSomeone blow it up tonight, we'll fight, fight, fight, fight\n\nTake a look at your haircut, you're killing me\nTake a look at your glasses, you're killing me\nPlacement of the piercings, are you kidding me?\nFight, fight, fight, fight, fight, fight, fight, fight\nWilliamsburg has got the lights down low\nAnd a moron with a laptop is calling this poetry\nA singer with a thrift amp - \"vintage circuitry\"\nOn the cover of Bop or Seventeen\n\nI'm so lonely, life is empty\nWhere's my coke and fucking money?\nTonight at the bar I got a good look at the enemy\nHe said \"My job's looking good and someone else can write the songs for me\"\n\nSoon we'll be in the clear when we get out of here\nWhere style is function and our egos make us fight\nFor now we'll live in fear, we're not sexy enough for this atmosphere\nSomeone blow it up tonight, please blow it up tonight\n\nNow we're cloning sheep\nWriting garbage in their diaries\nReading their AP\nAnd watching Fuse TV\n\nKill it, c'est la vie\nFashion show equals your scene\nBomb the industry, yeah\n\nThen run away or watch the blast\nI'm getting out so kiss my ass\nI'm going nowhere, nowhere fast\nI'm going nowhere, nowhere fast\n",
        "explanation": "So I guess this song is kind of the mission statement of Bomb the Music Industry! in a way because I wrote the lyrics after seeing people in bands just try and be so fucking cool all the time. Then I stayed at the Know How house for a bunch of days and here was a band that WAS really cool and just aren't image conscious. The second half of this song was partially written in a motel six in New Orleans with Sean Qualls. The two of us decided that we like each others' songs and since we're in ASOB together, we should write songs together and they'd be awesome. We wrote this song that had so many parts that I obviously wrote and so many parts that he obviously wrote and we couldn't get anything good. Except for the first like three minutes of the song which were this one part, which has been condensed for your listening pleasure. Oh yeah, a lot of the lyrics to this one are still being worked on so BEAR WITH US!!! (music by jeff rosenstock and sean qualls)",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-does-your-face-hurt-no-cause-its-killing-me-lyrics"
      },
      {
        "orderIndex": 3,
        "name": "It Ceases to Be \"Whining\" If You're Still \"Shitting\" Blood",
        "youtubeUrl": "https://www.youtube.com/embed/W6TYm7oJ13g",
        "lyrics": "Sing the fucking songs you told the world to sing\nSing it right unless you want to fail\nListen back and punch the shit that we don't like\nYou can't do it right in just one take\n\n[Pre-Chorus 1]\nBecause you aren't good enough\nYou were never good enough to sing your own songs oh so perfect\n\n[Verse 2]\nIf you fuck this up you fuck the record deal\nAnd respect of all our famous friends\nDrift too far and it is inaccessible\nDo it right, we worked as hard as you\n\n[Pre-Chorus 2]\nAnd we didn't come this far\nFor you to fuck this up and then just fuck our whole damn lives\n\n[Chorus 1]\nSo write some songs with lots of hooks\nRemember why you wrote songs in the first place\nLet's start a band\nThis is all that you can do\nSo write some songs with lots of hooks\nRemember why you wrote songs in the first place\nLet's start a band\nThis is all that you can do\n\n[Verse 3]\nSo cut the cookie, five sharp points to make a star\nCut the corners, get the biggest tours\nTraffic violations mean bad credit now\nTwenty triple zeroes in the hole\n\n[Pre-Chorus 3]\nAnd it wouldn't be so bad\nIf we crashed the fucking van and watched our fucking debt go up in flames\nYou know it wouldn't be so bad if we just threw up our hands\nInstead of feeding something I did not want to create\nYour underground is a mistake\n\n[Chorus 2]\nSo write a song without a hook\nRemember why you wrote songs in the first place\nNot to start a band\nWe've got nothing else to do\n\nLet's write a song without a hook\nRemember why you wrote songs in the first place\nNot for a man\nWho runs a fucking focus group\nSo write a song without a hook\nRemember why you wrote songs in the first place\nNot for a man\nWho runs a fucking focus group\n\nSo write a song without a hook\nRemember why you wrote songs in the first place\nNot to impress\nThe band you opened up for yesterday\n",
        "explanation": "To those in the know, it's pretty fucking obvious what this damn song is about. For those who aren't in the know, this is about all the pressures of being in a band that is about to break and feeling like if you DON'T break, you're personally responsible for all of it. It's also about the machine that a band creates when it decided to buy a van, sell merch, put out records, et cetera. Plain and simple. No universal message. Yeah, me neither.",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-it-ceases-to-be-whining-if-youre-still-shitting-blood-lyrics"
      },
      {
        "orderIndex": 4,
        "name": "Big Plans of Sleeping In",
        "youtubeUrl": "https://www.youtube.com/embed/W2tZ9j03Xlk",
        "lyrics": "[Intro: Spoken]\nShaun: Because I love her!\nEd: Alright!... Gay!\n\nEvery day's a hassle when you never sleep at night\nTossing and turning and shaking uncomfortably\nBut today's the fucking weekend so we're sleeping until five\nWake up and lock the door and burn off calories\n\nNever let go when you talk to me\nYour stories are boring, they put me to sleep\nThat's just what I wanted and I swear that's what I needed\nMy busy day of sleeping in\n\nCut power to the cellphones, automated all replies\nPassed out on couches, put wings in the microwave\nOpened up a bottle, it'll beep when they are done\nHeard it beep, fuck it, man, let's have another one\n\nDo you have a prob' if I drink some more?\nYou don't have a problem, let's both drink some more\n'Cause this is all I needed, yeah, alcohol and coffee\nMy busy day of sleeping in\n\nThey're all mindless sheep, oh yeah\nLet's kick everybody's ass and teeth right in\nNails right through their feet, oh yeah\nThe world can't move now, let's go back to sleep\nWhen we rejoin the public we'll just laugh at everyone\nThe chumps who celebrate four-month anniversaries\nThey're all fucking suckers and I'm done with everyone\n'Cause I finally found someone who's antisocial with me\n\nNever let go when you talk to me\nYour stories are boring, they put me to sleep\nEveryone can die now 'cause I found you and you're perfect\nMy busy day of sleeping in\n\nMy busy day of sleeping in\nMy busy day of sleeping in\n",
        "explanation": "I had never written a nice song about anyone ever and I'm really not sure why. Anyway, this is the first and only nice song I've ever written about a person so far. I had written the vocal melody in my head while I was just around Washington Square Park and I RAN home to 3rd Ave. and 14th St., waited for an elevator for a few minutes and ran and wrote it down. I couldn't think of anything angry to write on top of it, so I wrote a song about staying in one room all day with someone you love, watching tv, having sex, drinking booze and eating ice cream. When I was refining the lyrics I realized this isn't so much a love song as it is an alcohol song. Then I added the part about nailing everyone else's feet to the ground so they can't move thus they can't come over and bother me. At that point the song just became wrong. (Includes a sample from \"Shaun of the Dead\" which is an awesome movie)",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-big-plans-of-sleeping-in-lyrics"
      },
      {
        "orderIndex": 5,
        "name": "I'm A Panic Bomb, Baby!",
        "youtubeUrl": "https://www.youtube.com/embed/WZcBylbh0N4",
        "lyrics": "Mom, please wake up\nI can't sleep, my head's fucked\nNeed a hug or a drug\nSo please decide\n\nWhat's up, Doc?\nDo I think suicide?\nIn this room, yes, I do\nWhere's my form?\n\nNow question thirty-eight\nDo you have trouble sleeping late?\n\nWell, sure I got probs sleeping in\nPlease pump me full of Klonopin\nMom, Doc, stop taking bets\nOn whether I smoke cigarettes\n\nPrescribe goggles\nMake it dark all the time\nGo to school, get beat up\nGo to sleep\n\nYou're so bald\nYou don't know about\nMy life with hair\nStop the interrogation\nHey, Anne, I really think\nYou shouldn't tell me I can't drink\n\nWell, sorry, John, you're my best friend\nI didn't mean to try and kick your ass in the van\nI can't do weekly visits\nThree to six for results, fuck that\n\nI'm a panic bomb\nGet away from me\nPanic bomb, panic bomb\n\nI'm a panic bomb\nPlease get away from me\nPanic bomb, panic bomb\n\nAnd I know that you're all just trying to help\nBut I really think you're all just trying to get rich\nI don't need to be addicted to anything else\nI don't need to be addicted to anything else\n\nI'm a panic bomb\nGet away from me\nPanic bomb, panic bomb\n\nI'm a panic bomb\nHey, get away from me\nPanic bomb, panic bomb\nAnd I know that you're all just trying to help\nBut I really think you're all just trying to get rich\nI don't need to be addicted to anything else\nI don't need to be addicted to anything else\n",
        "explanation": "Written in a car on a drive home from upstate New York after a blizzard. I initially wanted it to be a part of some other thing I'm writing called \"John Starks: Motherfucker\" but when I got home, I added it in with some other thing I wrote and recorded on my cell phone and it seemed to work. This song is about my many trips to many doctors, mainly this one bald dude who told me that the best solution for being able to fall asleep at night would be to wear these goggles that look like those huge black sunglasses for old people, the ones that go around your entire head. He told me I should wear them all day through school and they cost like $500. He was also asking really intrusive questions for a dude I just met like \"DO YOU LIKE PAIN? DO YOU THINK OF KILLING YOURSELF? HAVE YOU EVER CUT YOURSELF? DO YOU SMOKE? YOUR MOM WANTS TO KNOW IF YOU SMOKE?\" I later assumed he was a goggle salesman in a fake office.",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-im-a-panic-bomb-baby-lyrics"
      },
      {
        "orderIndex": 6,
        "name": "Sweet Home Cananada",
        "youtubeUrl": "https://www.youtube.com/embed/mcPWPJcmHeo",
        "lyrics": "(That's not special, I mean...\nI mean that fucking bullshit lie about how \"he cares about us!\"\nYou know what? He doesn't give a fuck about any of you! He doesn't give a fuck about you, or you, or you, or your mommy, or your granny, or your street, or your town, he doesn't give a flying fuck about any of you.)\n\n(And that fucking bullshit lie about how \"he's just like us!\" He's just down homeboy! He's a good ol' boy from midland Texas! I'm a straight shooter man! I'm a Washington outsider!)\n\n(I'm such a Washington outsider, JUST like you, 'cause I'm sure all y'all had the same kind of upbringing, just like me, where your daddy was Head of the CIA, and Ambassador to China, and Vice President for eight years, and then President of the United States for FOUR years!)\n\nI heard from you today by digital replay\nYou told me that you care, you'll help from over there\nI say we're not the same, it's falling on deaf ears\nAt eighty miles an hour and I forget to steer\n\nAnd if I wrap my car around the guardrails, ain't got shit to do with you\nSo drop the act, I know your true agenda\n\nCan't live with the mistakes, I'll move out of the states\nTo South America or north to Canada\nI lived four years of lies, I lost faith in mankind\nWith no one to befriend, I guess this is the end\n\nAnd it's not glorious like in the movies, explosion and a note\nIt's more like driving as far away as possible alone\n\nAnd please don't say goodbye to remind me you're alive\nYou've been dead to me since I started feeling dead inside\nSo don't look down on me and say we feel the same\n'Cause we don't\nI'm checking out, I'm fucking done\nKiss my fat ass, I'm giving up\nEat shit and die, I'm taking off\nHave a nice life, have a nice death\n\nI'm checking out, I'm fucking done\nKiss my fat ass, I'm giving up\nEat shit and die, I'm taking off\nHave a nice life, have a nice death\n\nI'm checking out\n",
        "explanation": "So, I was getting a lot of messages from an ex-girlfriend who I had been hurt by and didn't really want to call back and share my problems with. While all this way going on, that motherfucker George W. Bush got re-elected and I decided that if I moved to a different country, it wouldn't matter if I had a band or if i had an ex-girlfriend or if i had Bush was president here... all those problems would go away. I guess everyone wants to get away from shit once in a while. This whole song was recorded using Garageband and this microphone that is apparently somewhere inside my computer. You can hear me feeling the computer at the beginning trying to find the microphone. I never did. There's also no electric guitars or bass... just distorted acoustic guitars. (includes a sample from David Cross's \"Shut Up You Fucking Baby\")",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-sweet-home-cananada-lyrics"
      },
      {
        "orderIndex": 7,
        "name": "Funcoland Vs. The Southern Electorate",
        "youtubeUrl": "https://www.youtube.com/embed/xAB0ixdy7oc",
        "lyrics": "Insurance, blow on it!\nDebt, blow on it!\nGlobal warming, blow on it!\nRacist assholes, blow on it!\n\nBlow on it like an old Nintendo!\n\nBroken car, blow on it!\nBroke guitar, blow on it!\nBroken amp, blow on it!\nPissed off girlfriend, blow on it!\n\nBlow on it like an old Nintendo!\n\nThis is how we solve all the problems in the world\nThis is how we solve all the problems in the world\n\nMiddle East, blow on it!\nTerrorism, blow on it!\nDonald Rumsfeld, blow on him!\nGeorge Bush, blow on it!\n\nBlow on it like an old Nintendo!\n\nUnemployment, blow on it!\nAlcoholic, blow on it!\nAshlee Simpson, blow on her!\nTuberculosis, blow on it!\nBlow on it like an old Nintendo!\n\nThis is how we solve all the problems in the world\nThis is how we solve all the problems in the world\nThis is how we solve all the problems in the world\nThis is how we solve all the problems in the world\n",
        "explanation": "We were at our first Bomb the Music Industry! practice and John's amp wouldn't work so he blew on it. We asked him what the hell he was doing and he said he didn't know, he was trying to fix it like he would fix a Nintendo cartridge. He then suggested that it would be awesome if we could fix all of our problems like that, by blowing on them. He told me I should write a song about it. I told him HE should write the fucking song, jeez. The next day, I remembered a hardcore song I scribbled down while on a subway while I was in the shower and figured out how this could be a song. John was pretty surprised at the turn-around period of one day. (concept by john dedomenici)",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-funcoland-vs-the-southern-electorate-lyrics"
      },
      {
        "orderIndex": 8,
        "name": "Ready... Set... No!!!",
        "youtubeUrl": "https://www.youtube.com/embed/phEmrL3TtWs",
        "lyrics": "I never was a drinker, now I'm an alcoholic\nDrinking just to fall asleep\nAnd hiding my smiles\n'Cause you can probably smell this shit on my teeth\n\nDrink it down, golden brown, my sweet whiskey\nYou feel nice on the inside\nSo nice on the inside\nSo nice on the inside, so let's get pissed\n\nI never cried at movies, now I cry at The Simpsons\nHide the tears so you can't see\nI wipe my eyes\nAnd I pretend that I'm just falling asleep\n\nDon't come around, I've already destroyed everything\nI'm not coming outside\nI'm not coming outside\nI've blown my only chance, so don't make me do anything\n\nFrom the moment it was up to us\nTo break the rules and disobey\nI'd trade it all in for an easy answer\nTo let me raise my fist and say \"no, thanks\"\n\nI'm a target audience, paranoia's setting in\nI can't have a conversation, you're just like the other kids\nI'm well aware that they're monitoring my thoughts\nAnd if you count on me for anything, I'm sorry but you're\nTotally fucked\nYou're fucked\nEverybody's out of luck\nI'm just a kid and I want to get drunk\n\nIt's nighttime, look outside\nIt's nighttime, look outside\nIt's nighttime, look outside\nLet's go drink 'til we can't feel shit\n\nFrom the moment it was up to us\nTo break the rules and disobey\nI'd trade it all in for an easy answer\nTo let me raise my fist and say \"no way\"\n\nI've got to find something that's wrong with everything\nSo now I'm all alone\nForget solutions, I'll be at the bar drinking\nForgetting everything I know\n\nAnd when the record stores start falling then it's up to us to break rules\nStop sitting in your room and watching advertisements and disobey\nPut down the bottle, get a megaphone and shout it to the world\nNo way, no way\n\nNo thanks\nNo thanks\nNo thanks\nNo thanks\nNo thanks\nNo thanks\nNo thanks\n",
        "explanation": "After ASOB decided not to tour or play for a little while, I was freaking out about what the hell was I gonna do with my life and I started developing these really weird tendencies. One night I decided it'd be a good idea to make a list of these problems I kept blowing up out of proportion and that it would solve everything. It didn't solve anything at all, but it turned into this song. On a lighter note, I wrote the music to this while searching the streets of midtown Manhattan for my grandmother after she wandered off during a family get-together.",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-ready-set-no-lyrics"
      },
      {
        "orderIndex": 9,
        "name": "I'm Too Cooooool For Music",
        "youtubeUrl": "https://www.youtube.com/embed/9M-S2ztR8OE",
        "lyrics": "[Verse 1]\nDelusions, delusions, delusions of grandeur!\nGrab the motherfucking tape machine, I'll show you I'm the shit\nWait and see, wait and see, bask in creativity!\nI'm too cool for music, faggot, music isn't cool enough for me\nI learned the F-word now\nThat's a poignant social statement from my old hometown\nSieg Heil, Sieg Heil, So the world can see\nHate rock isn't hate rock if we're callin' it \"irony\"\n\n[Chorus]\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou think it's stupid? You don't get it!\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou don't know anything\n\n[Verse 2]\nYou can't satirize queer culture if you aren't really gay\nYeah, you can't be anti-PC when no one cares what you say\nAnd you can say the kids are idiots but you're still up on the stage\nShock value! Shock value! Shock value! Shock value!\nShock value! Shock value!\n\n[Verse 3]\nI'm just here to entertain!\nFeels like GG Allin but derivative and lame\nMan, who needs music when you can call people names?\nSongs are total bullshit, man\nMusic isn't cool enough for me!\n\n[Chorus]\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou think it's stupid? You don't get it!\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou don't know anything\n\n[Instrumental Break]\n\n[Chorus]\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou think it's stupid? You don't get it!\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou don't know anything\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou think it's stupid? You don't get it!\nWe're doing it right, we're doing it right\nYou've got the wrong idea\nYou think you're something, yeah?\nYou don't know anything\n",
        "explanation": "I don't like noise rock bands that don't have the decency to do anything interesting. I don't like bands that use the f or n words while speaking without any reason for it except to shock people. I especially don't like when bands use those words out of hate. And that's that. (includes a sample from \"Arrested Development\" which airs on Fox every Sunday at 8:30 and you should watch it)",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-im-too-coooool-for-music-lyrics"
      },
      {
        "orderIndex": 10,
        "name": "Pike St. - Park Slope",
        "youtubeUrl": "https://www.youtube.com/embed/lAZlJHkFr5g",
        "lyrics": "Drive across the country, tell your story walking\nNo one is keeping you captive in a town that let you down, so sorry\nBlame it on the television, blame it on the company\nDon't blame it on the fundamental fact that no one owes you something\n\nI've come about my share, I only want what's fair\nAnyone who knows me knows that I'm not greedy\nLike everybody else I want to pay my dues\nI only want someone to tell me who to make the check out to\n\nMaybe we could run away and start a little repertory movie house or something\nShe said, \"Sorry, but I think you might be just projecting\"\nBut here's the dough\nPike Street to Park Slope, Brooklyn\n\nA community of dabblers who are vain and fond of biting backs\nWe hate it when our friends become successful\nAnd a different school whose energies are spend evading income tax\nAnd silicone enhancements by the breast-full\n\nMaybe we could run away and start a little repertory movie house or something\nShe said, \"Sorry, but I think you might be just projecting onto me\"\nWhy don't you try LA?\nPike Street to Park Slope, Brooklyn\n\nWhen you like something it's an opinion\nBut when I like something it's a manifesto\nPomposity is when you always think you're right\nArrogance is when you know\n\nMaybe we could start a little independent repertory movie house or something\nShe said, \"Sorry, but I think you might be just protecting your investment\nOr else assigning blame\"\nPike Street to Park Slope, Brooklyn\n",
        "explanation": "This is a song by Harvey Danger and is a piano ballad in it's original form. I always liked it though, especially the lyrics which Harvey Danger always do exceedingly well. This was one of three songs I was thinking of covering (\"Bastards of Young\" by the Replacements and \"Wave of Mutilation\" by the Pixies were the other two) when I decided to see how all my recording shit worked. I actually wanted to put out mini-EPs of cover songs every month, a different artist every month but that turned out to be too much work after I started dealing with this one. For some reason, the tracks to this song were always allocated to my computer (small hard drive) instead of my hard drive (big hard drive) so it became almost impossible at the end to mix it in any way whatsoever. When recording the vocals and guitar parts, there was all this delay because the computer had to process everything, so I had to go in and line all the tracks up by hand, and then the computer would tell me there wasn't enough memory to do THAT, i'd have to restart it and do a little bit more and repeat. So this was a royal pain in the ass and doesn't sound too great but it's the best I've got. It's a shame because I really really do like the song, and the arrangement should have been pretty cool. But I'm also relieved I didn't do this on any of the songs I wrote. (from the album \"King James Version\" by Harveey Danger)",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-pike-st-park-slope-lyrics"
      },
      {
        "orderIndex": 11,
        "name": "FRRRREEEEE BIIIIIIIRRRRD!!!!!!",
        "youtubeUrl": "https://www.youtube.com/embed/XRnCu8QzEic",
        "lyrics": "[Verse 1]\nDon't you say\nDon't you ever ever say that it was worth it\nFor the profit, yeah\nAnother day when I lay there shit-faced\nThen I smile when I'm on and sing the songs I did not write\n\n[Pre-Chorus 1]\nAnd they'll dance to it\nAnd I'll smile and I'll get paid\nBaggy pants are stupid\nAlt-rock, Skynard, play another song I hate\n\n[Chorus]\nI'll just stay on the state streets\nComplaining that's it's all the same\nBut too lazy to change anything\nAnd I can't spend another day thinking\nThese places on street signs\nAre the only places that I've ever been\n\n[Verse 2]\nDrink a free beer, maybe smoke with the waiter\nIt's the illusion that they all give a shit\nAnd some drunk guys yelling \"Freebird!\" and \"Show us your boobs!\"\nAnd I'll smile when I key their truck, yeah!\n\n[Pre-Chorus 2]\nAnd it sucks so bad\nBut I made one Benjamin\nHow can I be mad?\nI made one-seventh of my rent and maybe I'll go buy a plate of eggs\n\n[Chorus]\nI'll just stay on the state streets\nComplaining that's it's all the same\nBut too lazy to change anything\nAnd I can't spend another day thinking\nThese places on street signs\nAre the only places that I've ever been\n\n[Bridge]\nNot feeling Minnesota\nI sit next to an ATM and people check their balance during my set\nAnd play cover songs from the 90s\nBy one-hit wonders, Chumbawumba, Tubthumper\nAnd a jersey-wearing motherfucker withdraws his twenty bucks\n\n[Chorus]\nI'll just stay on the state streets\nComplaining that's it's all the same\nBut too lazy to change anything\nAnd I can't spend another day thinking\nThese places on street signs\nAre the only places that I've ever been\nI'll just stay on the state streets\nComplaining that's it's all the same\nBut too lazy to change anything\nAnd I can't spend another day thinking\nThese places on street signs\nAre the only places that I've ever been\n",
        "explanation": "Laura Stevenson wrote this song about this gig that she was really bummed about doing. She's a singer/songwriter and plays in bars and stuff. This is about doing that and having redneck idiots (because for some reason EVERYWHERE is filled with redneck idiots) shouting \"show us your knockers!!!\" or \"play some skynyrd man!!!!\" So anyway, Laura writes this song... this SKA song and obviously is like \"hey, jeff, i wrote a ska song! isn't that weird!\" because it IS weird because she doesn't write ska songs. But I get really awkward when people play songs for me 'cause I usually hate them. So, I covered my eyes and put my head in my lap and she played and sang the song for me and it was actually REALLY REALLY good. So I told her I liked it. She didn't like the words and didn't know how to end the song, so I added the bridge, put a bunch of \"fucks\" in there, and voila! song! (music and lyrics by laura stevenson and jeff rosenstock)",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-frrrreeeeee-biiiiiirrrrrd-frrrreeeeee-biiiiiird-lyrics"
      },
      {
        "orderIndex": 12,
        "name": "Future 86",
        "youtubeUrl": "https://www.youtube.com/embed/zBk6ZP8hQDU",
        "lyrics": "[Verse 1]\nCan I stop my life so I could just be with you?\nLet's hightail to Hawaii on a plane\nI'll embezzle what's left of my band fund\nTo take necessary action to destroy what I have made\nYou and I, we'll move to New York City\nI'll get a temp job, you'll start your career\nI'm not being fickle, just realistic\nThe air is moist but it never gets too cold this time of year\n\n[Chorus 1]\nSo tell me was it worth it?\nAnswer before I get in my van\nTo drive into the Pacific\nWhere I'll probably never see your face again\n\n[Verse 2]\nSay the word and I'll put my guitar down\nI'll be sad but at least we'll both get laid\nWe'll start to fight when I start to resent you\nAnd we'll both agree the thought was nice but I should not have stayed\nTake the I-Whatever to desolation\nAnd now fast food's reminding me of you\nSo I'll write postcards and I'll forget to send them\nThanks a lot, I lost my mind and now I'm losing you\n\n[Chorus 2]\nSo tell me something awesome\nThat can last my whole life sentence in the van (The van)\n'Cause I'm on the SS Ambition to nowhere\nAnd I'll probably never see your face again\nSo tell me something awesome\nThat can last my whole life sentence in the van\n'Cause I'm on the SS Stupid Goals to nowhere\nAnd I'll probably never see your face again\n\n[Outro]\n'Cause I'm on the SS Bullshit Dreams to nowhere\nAnd I'll probably never see your face again\n",
        "explanation": "I had just watched Dr. Strangelove and there's this song at the end of it that I thought was FUCKING AMAZING so I decided I could rip it off and no one else would ever really know. Then I lost the DVD (which didn't belong to me) so I couldn't go back for reference when I actually recorded this. This was recorded for ASOB, but when it came time to re-record it, everything sounded a lot more forced and less natural than the original demo, so we opted to keep this version instead and just add the band singing background vocals. We recorded two tracks of vocals on the way to a show in a barn in Massachusettes, one in the back of the van, one in the front. Once we got to the barn, we handed out lyric sheets to all the kids, played this song and said \"if you wanna sing vocals on the album version of this song, stick around after the show.\" We got probably 80 or 90 kids to stick around and sing and clap and the Know How guys did the same. It was a lot of fun, but I decided to put it on this because the compilation it was recorded for never really came out and this is the ultimate bedroom rock and roll song.",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-future-86-lyrics"
      }
    ]
  },
  {
    "orderIndex": 2,
    "name": "To Leave or Die in Long Island",
    "description": "\"To Leave or Die in Long Island\" by Bomb the Music Industry!, released in 2005, is a seminal album that epitomizes the band's distinctive blend of punk, ska, and indie rock. Led by the creative force of Jeff Rosenstock, the album captures the essence of DIY ethos as it was recorded entirely on a laptop with minimal resources. The tracks navigate themes of disillusionment, self-discovery, and the challenges of young adulthood, with Rosenstock's raw and emotive vocals serving as the driving force. The album's eclectic instrumentation and energetic performances create a dynamic and engaging sonic experience, showcasing Bomb the Music Industry!'s commitment to pushing musical boundaries and challenging traditional industry norms. \"To Leave or Die in Long Island\" stands as a testament to the band's authenticity, innovation, and influence within the alternative music scene.",
    "explanation": "I started writing songs for this record almost immediately after Album Minus Band was done, but the tricky thing about it was that I started working so much more. It became really difficult to find time after an eight hour work day to crank up your guitar in a way that wouldn't piss off the neighbors, so they wouldn't call the cops. I tried to find time on the weekends, but after suffering from a little bit of writer's block, my girlfriend eventually moved into my house with my parents while she started looking for a job. This left me very little time to actually sit and have fun recording stuff. So I did what any idiot would do, I started growing a beard. I would not shave off the beard until I finished this EP. This wasn't a cold weather beard that insulates and protects your face. No. This was a sweaty, gross, ninety degrees in a fucking basement with no air-conditioning beard. I eventually started working harder to make some time to do this, and the EP slowly turned into a full-length record. This record is about living in a place that you feel you really don't relate to and don't belong in. Whether it's the musical gangs, the ass-kissing, the cokeheads or the desperate attempts of other people to hit it big, for me this record was about how I was going to get out of this fucking place. It was all written in Long Island and it is very expressive of my hope to go around the country playing stupid songs for people who will forget me again. There were a few songs that felt out of place and not fully completed, so I was left with this really weird amount of songs and minutes - too much for an EP, too little for an LP. So let's call this batch of MP3s a ten-inch.",
    "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
    "bandAbbrv": "btmi",
    "year": 2005,
    "ep": false,
    "songs": [
      {
        "orderIndex": 1,
        "name": "Happy Anterrabae Day!!!",
        "youtubeUrl": "https://www.youtube.com/embed/03wPW3VGiKQ",
        "lyrics": "When we're not feeling strong, we grab the mic and sing along\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\n\nWhenever I go to a show\nIt always feels like I've been time warped back to the eleventh grade\nThe scene's uniting so the gangs can keep on fighting\n\"Don't say the wrong thing or I'll see you in the parking lot.\"\nBrass knuckles are a great equalizer\nWhen you have no self-esteem\nIf one guy is outnumbered\nHow are you the winning team?\nDon't get mad if you're hit in the mosh pit\nThis is a friendly release\nI doubt that some fourteen-year-old\nIs trying to disturb your peace\n\nWhen you bring your fist back to start the attack\nThink about the kid\nYou're much too old. He's all alone\nWalk away. Don't kick his fucking ass\n\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\n\nSo if I kissed you on the nose or offered you a hug\nHow could you possibly still wanna fight?\nWe'll drink some beers (or if you're straight edge, we'll drink cola)\nAnd we'll talk about how much we both liked Scarface\nYou'll back down because you're homophobic\nGold medals go to the pacifists\nWho won't fight you — sorry, dude\nThis is passive resistance\nBecause we're all here for the same stupid reason\nWe all like some stupid band\nSo let's sing loud, proud and clear\nIn a language we both understand\nWhen you bring your fist back to start the attack\nThink about the reason\nYou went to shows at twelve years old\nWe all felt alone. It was NOT to kick my ass\n\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa na na na na\nNa\n",
        "explanation": "This song probably took the longest out of any Bomb the Music Industry! song I've ever written to finish, and that's mainly because it was predicated on ridiculousness. The introduction was originally crafted to kick off “John Starks: Motherfucker”, a mini-punk-rock-opera based on the New York Knicks losing the 1994 Eastern Conference Finals, which I felt was the first time in my life I had a panic attack. I eventually decided to whittle it down to a two and a half minute song, but trying to write lyrics relating missing lay-ups to social anxiety to punk rock to the depressing nature of interacting with fake people all day... well, it wasn't that it was tough as much as it was trite. It was boring and forced. My plan to place constraints on myself to write something outside of my own voice that was a bit different had become a failed experiment. During 2005 I had a job as a graphic designer at a venue in Long Island, and ended up seeing quite a few hardcore shows because of it. When I was a kid, I was originally attracted to hardcore because I didn't feel like I was connecting with whatever it was the rest of the kids in junior high were feelin'. It pissed me when tough guys would start fights because it felt a lot like football, and watching hardcore shows today in Long Island, it has actually escalated to the point where gangs are involved. I feel like gangs are so against the punk rock mentality of thinking for yourself. Y'know, only in fucking Long Island. Eventually I clearly realized that this issue was something I felt a bit more passionately about than John Starks. Speaking of passionately, the moral of this song is that if you make out with a member of a hardcore gang, he'll probably leave you alone because he is most likely a homophobe.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-happy-anterrabae-day-lyrics"
      },
      {
        "orderIndex": 2,
        "name": "Congratulations, John, On Joining Every Time I Die",
        "youtubeUrl": "https://www.youtube.com/embed/cvSwCRIIikY",
        "lyrics": "Congratulations! Go stretch your ears and get a neck tattoo\nCongratulations! All of our friends knew there was no better choice than you\nWhoa Whoa Whoa Whoa\n\nCongratulations! Are you gonna move up north and throw away your Yankees hat?\nCongratulations! Are you gonna swear off ska and stop gelling your hair back?\nWhoa Whoa Whoa Whoa\n\nNice going asshole\nNice going asshole\nNice going asshole\nNice going asshole\nYou finally did something right and I'm 2% bummed it wasn't me\n\nI hope you know that Christine's gonna ask you to get into all your shows for free\nAnd I will smile while silently resenting you for quitting Bomb the Music Industry\nWhoa Whoa Whoa Whoa\n\nNow Dave has another friend who's in a more successful band\nNow Jenna's got another contact and another drummer to make out with again! w00t!\n\nNice going asshole\nNice going asshole\nNice going asshole\nNice going asshole\nYou finally did something right and you'll probably meet Dave Grohl\nAnd tell us about him when you get home\n\nThen you'll get the news from me that you'll never quit the band\nAnd we're taking you out on tour for those two months a year that you're home because we can\nAnd sure it's out of spite not to replace you, but you promised and we shook hands\nSo remember when you're back in Long Island, you will forever be forced to be a part of a ska band\n\n123 123 pick it up 123\n\nNice going asshole\nNice going asshole\nNice going asshole\nNice going asshole\nYou finally did something right, I guess state college did pay off!\nWe're all music majors too, can you make Ferret give us jobs\nOr at least tell Ferret to sign my band?\n",
        "explanation": "For any musician, a day job can be a pretty depressing thing - kind of a constant reminder that you're not successful or good enough to do what you feel is your strong suit for a living. So when John (our guitar player) found out that Every Time I Die's bassist quit last winter and at the same time realized that a couple of his friends were also good friends with the ETID gang, we all decided to celebrate. I mean, the only requirements for the band aside from the ability to play the bass was that you have to like AC/DC and you have to drink a lot... how could he not get it? This song was meant to congratulate John because we all truly felt he was going to get this gig. This song was also meant to yell at John because his getting this gig would definitely have held up BTMI! a bit. It turns out that his friends forgot to make phone calls until it was too late and they already got the guy from Between The Buried And Me to do it, which allowed John the necessary free time to play the few shows we'd had in 2005. This song is mainly inside jokes, and also part rumor that I heard in a magazine which said ETID's newest album would be produced by Dave Grohl. I think I read that in Revolver. Punk rock, man.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-congratulations-john-on-joining-every-time-i-die-lyrics"
      },
      {
        "orderIndex": 3,
        "name": "Showerbeers!",
        "youtubeUrl": "https://www.youtube.com/embed/41yu09hI2QQ",
        "lyrics": "I just got paid so it's a heavy night of drinking\nYou can smoke in the bar so when I come home I'm stinking\nThe smell on my clothes is offending to the nose\nBut that's not the reason that I'm stepping in\n\nThe only reason I take a shower is so I can drink a showerbeer\nSo I can drink a showerbeer\nSo I can drink a showerbeer\nSo I can drink a showerbeer\nSo I can drink a\n\nI just lost my job so it's a heavy night of drinking\nYou can smoke in the bar so when I come home I'm stinking\nThe smell on my clothes is offending to the nose\nBut that's not the reason that I'm stepping in\n\nThe only reason I take a shower is so I can drink a showerbeer\nSo I can drink a showerbeer\nSo I can drink a showerbeer\nSo I can drink a showerbeer\nSo I can drink a\nShowerbeer!\n",
        "explanation": "If you have never drank a beer in the shower, you're missing out on one of the finer things in life. When I was on tour with ASOB, the shower rotation went in a way that I was generally one of the people to shower at night - there was less stress of showering quickly and I didn't have to wake up early to do it. When there was a house party though, it kinda sucked to have to put the drinking to an end because I had to clean myself. Unlike most punk rockers, I like to shower as much as possible - it's my little bit of OCD. After the first time I decided that “hey, i could fucking drink beer while i shower,” not only did the night showers not seem so bad - I found myself showering at parties even when I didn't have to. So I figured that'd be something to write a song about. So I told James Lynch. He said “yeah... it could go ‘the only reason i ever shower is so i can drink a showerbeer.” Once someone else gets in on a dumb song idea, I have to end up writing it.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-showerbeers-lyrics"
      },
      {
        "orderIndex": 4,
        "name": "Stand There Until You're Sober",
        "youtubeUrl": "https://www.youtube.com/embed/-dootQfjKZk",
        "lyrics": "[Verse 1]\nBrown paper bags metal cans\nSixty degrees Fahrenheit\nWe can't see the stars tonight 'cause apartments generate ambient light\nI'm sorry that we're not already drunk\n\nHours later we're getting there\nMeters away from the shore\nMy forty of Corona is just drops away from being kicked\nAnd I don't know what I'm gonna be tomorrow\n\n[Chorus 1]\nWhen you stayed overnight making out with a stranger\nIn the bottom of a boat that belonged to a stranger\nAnd you came home at six in the morning\nAfter being caught ass naked by the dude who threw the party\nI thought that we'd never grow up\n\n[Verse 2]\nAnd now all my friends rise at eight\nThey go to sleep before midnight\nAnd I just wanna drink 'til three embarrassing myself publicly\nAnd you all used to be just like me\nYou fuckers used to be just like me\n\n[Chorus 2]\nNow I sit and stew alone, everyone's already sleeping\nEverybody's moved away and can pay their bills on time\nNo one else is making a hundred and ten bucks for twenty hours\nGod I hate this fucking place\nGod I hate what happened to me\nYou promised we'd stay best of friends\nBut we can't cause I can't grow up\n\n[Bridge]\nAnd it kills me, yeah it kills me\nThat I don't know what I can do\n'Cause I can't breathe correctly and\nI can't sleep or anything and\nI can't think of anything\nI can't think of anything\n\n[Verse 3]\nNow every night's miserable\nI'm so sad that I can't even get drunk\nSo let's go out just one last time, let's finish off a box of wine\n(Let's go out just one last time, let's finish off a box of wine)\nDo shots of Yukon Jack and lime, can we drink 'til I fucking die?\n(Do shots of Yukon Jack and lime)\n\n[Chorus 3]\nI'll make you party at my funeral 'cause mourning is for suckers\nI'll rent a Ferris Wheel and cotton candy machine and have an open bar\nWith all the Pabst that you can drink, the PA blasting my Clash records\nYou'll finally know life's okay even when the bad things happen\n\n[Verse 4]\nSo just one more beer then grow up\nSo just one more beer then grow up\nSo just one more beer, go to work, pay your bills, eat a dick\nOne more beer then grow up\n",
        "explanation": "It's pretty depressing to come back home from the life of living day to day and showing up in new places and having everyone pay attention to you and think you're this big awesome shit and being a part of that whole working thing again. When I was writing this, I was applying to about fifty jobs a week and getting no responses, which as someone who took out a lot of loans to go to school so this WOULDN'T happen, it just killed me. Oddly enough, all my friends from school seemed to be doing really well all my friends in bands seem to be doing really well with their bands and I'm still living with my parents and working in a basement for minimum wage because I can't afford to lose the job and ask for a raise. So, I was thinking about all of this shit and that Against Me! song \"8 Full Hours of Sleep\" was stuck in my head and I wanted to write a song like that really badly. Eventually, this song ended up being one of the very few songs I have that show that I listen to Neutral Milk Hotel and the Arcade Fire. The words are partially about a friend of mine who has done some amazing things when she drank. They're also partially about drinking unholy amounts and still not getting drunk which is the WORST feeling ever. Not much electric guitar in this song, quite a bit of fuzz bass... I used an amp called the Kasino Fever which has an insane amount of fuzz on it... the kind of fuzz that just can't be contained sometimes. Also, I used a set of resonator bells that used to be owned by Tommy Dorsey which is pretty crazy. OK. That's enough I bet.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-stand-there-until-youre-sober-lyrics"
      },
      {
        "orderIndex": 5,
        "name": "Dude, Get With The Program",
        "youtubeUrl": "https://www.youtube.com/embed/9dwVjCXky4A",
        "lyrics": "Pack and get out fast\nNo going out with a blast\nNo leaving here tomorrow\nAnd don't think about a severence fee\nUnemployment won't be paid by crooks and cheats\nSo enjoy your rice and beans if you can afford the beans\nThat's a little joke that I have\n\nA fuse with dynamite sticks attached\nA hand that's holding a match\nAnd lighting it tomorrow\nAnd the flames of discontent will not be washed away\n'cause the flames will be kept alive by piles of cocaine\nIt didn't have to be this way\nYou could have figured out a way to help us out but you just said\n\nHey go ahead and get fucked\nHey go ahead and get fucked\nYou could be dead and no one here would care\nSo go ahead and get fucked\nYeah go ahead and get fucked\nYour every minute here has been in vain\n\nDon't give the money to the kids\nVapoRub on the eyelids\nNothing will change tomorrow\nTell us how we're all making sacrifices\nBut it's hard to sacrifice when we don't make decent wages\nHave you seen our salaries?\nIt's kinda like your salary except without all the zeroes\n\nYou're working on your first million\nI'm on my first thousand\nAnd bills are due tomorrow\nSomething about helping out the family\nBut that must means your kid can drive a Mercedes\n'Cause there's no relation here\nFamily does not get pushed out the door and get told\n\nHey go ahead and get fucked\nHey go ahead and get fucked\nYou could be dead and no one here would care\nSo go ahead and get fucked\nYeah go ahead and get fucked\nYour every minute here has been in vain\n\nSo take your things off the shelf\nYou got about an hour, you're a peon with no power\nSo don't you tell ME that I did something wrong\nSo take your things off the shelf\nI'll be in the other room with a lighter and a spoon\nGo on get get on your way\n\nIt's not fired, it's laid off\nYou didn't get fired, you're laid off\nYou could be dead and we'd all really care\nIt's not fired, it's laid off\nYou didn't get fired, you're laid off\nYou could be dead\nCutting corners! downsized! laid off!\nCould be dead in a box\nYou could be dead in a box\nYou could be dead and nobody would care\nSo go ahead and get fucked\nHey go ahead and get fucked\nAnd you deserve exactly what we're giving you\nAnd we're giving you nothing\n\nFuck you\n",
        "explanation": "This song was actually written a while before it was recorded as \"...And Now I Live In Athens.\" It was basically a response to a lot of people asking me about my former bandmates, whether I see them at all anymore, how it feels to have ditched them which I never saw it as the case. I just saw it as taking a breather. So this song was very much about what I felt was well worn territory within my songs: leaving it all behind! Wow! So it sat around for a little bit, and I really loved the song so I guess subconsciously I didn't wanna put it out with lyrics that I felt kinda half-assed about. Then one day I came into work and an owner at my job got everyone together in a circle and said \"Look, I don't know who you guys are necessarily or what you do, but I feel like we're a family here.\" What I later had heard from other people I worked with was that he brought up the term \"family\" to justify making paycuts to some pals of mine as some kind of effort to \"pull through together.\" By the end of the week, rumors had started floating around about a lot of people losing their jobs,and subsequently those rumors turned out to be true. About a day or two after this meeting, I was in the shower before a show and thought of the \"pack and get out fast, no going out with a blast\" line. I thought \"hey... maybe that's a better start to the song.\" When I left the shower, the subject matter of the song changed dramatically to kind of suit where I was when I wrote THIS thing and I ended up being happier with this than most of the songs I've ever written.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-dude-get-with-the-program-lyrics"
      },
      {
        "orderIndex": 6,
        "name": "Bomb The Music Industry! (And Action Action) Are Fucking Dead",
        "youtubeUrl": "https://www.youtube.com/embed/0x5exNfeyVE",
        "lyrics": "One more just passed me by\nI'm running out of fake interest in everybody doing shit\nI think about ten months ago when\nI was drinking in Seattle about as far away as I could go\n\nSo wait 'til tomorrow\nIt's happiness vs. survival\nAnd you know that life can be a drag\nI'll be here at the bottom of the pile\nBrass rings were never my style\nDon't mind me 'cause soon I'll be out of your way\n\nWhere can anyone possibly be comfortable?\n'Cause everybody has to eat and there's not enough to go around\nAt a job working for a power grab or at a show bitching about a time slot\nWe all gotta be heard and it's all the same\nNo one has anything interesting to say\n\nSay \"Fuck tomorrow!\"\nStop worrying about your survival\nYou know that life will be a drag\nYou'll punch and kick to the top of the heap\nAnd you'll be replaceable like a million other sheep\nWorkers of the world unite and just give up\n\nGive up on me\nThe truth is I'm not happy either way\nCause everyone is so original\nEverybody's clever nowadays\nI wanna leave the human race tonight\n\nI'll wait til tomorrow\nI always wait til tomorrow\nYou crushed my spirits for today\nI'm happy at the bottom of the pile\nBrass rings were never my style\nJust try and be polite when you push me out of your way\n",
        "explanation": "I wrote this song after I saw a couple of my friends start to get even MORE jobs and get promoted to better jobs and I felt like I was kinda staying stuck where I was. The positives of this were that I didn't have to wake up early and commute, I got to do something that was mildly creative and most importantly I didn't have to kiss anybody's ass or edge anyone out for the top. I also feel a lot better about making music when I don't have to do those things. It still stings quite a bit when your friends start lapping you, getting raises before you even get a career going but the truth is if you work too hard at anything, you're not gonna be clever or creative: you're going to be part of the 90% of the population that tries too hard to advance at what they're doing. So this song is about taking stuff at your own pace even if your future depends on it. It's also about how miserable that can make you. The song title is a reference to an old Born Against song. A lot of bands have taken that song title and made it their own and I felt that it would be REALLY CLEVER if I did it too. Also, the \"Everybody's clever nowadays\" vocal part was ripped straight from the Buzzcocks. This song was actually a very conscious attempt not to write a song with a million parts, considering I had just finished \"Dude...\" and that song seemed to have a lot going on. Verse, chorus, verse, chorus, bridge, instrumental break, chorus. Simps.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-bomb-the-music-industry-and-action-action-and-refused-and-born-against-are-fucking-dead-lyrics"
      },
      {
        "orderIndex": 7,
        "name": "Brian Wilson Says SMiLE a k a Beard Of Defiance",
        "youtubeUrl": "https://www.youtube.com/embed/3vWcKzOTKEI",
        "lyrics": "[Intro sample from The Spongebob Squarepants Movie]\n[Spongebob] Huh, I don't feel any diff- oh my gosh Patrick! You have a mustache!\n[Patrick] So do you!\n[Spongebob and Patrick] Ohh... Aww... Ohh...\n\nI'm twenty-two and I live at home\nAnd I hate my shitty job and shitty wage\nI feel like I need an attitude adjustment\nWhen the transformation's over you can see it on my face\n\nGrow a 'stache and a beard and\nMove out to the woods\nDo the H.D. Thoreau thing and start feeling good\nDisconnect the phones and sever all the credit cards\n\nYou hate the options they present to you\nAnd everything is owned by someone lame\nHere's a lesson how to deal with corporatization:\nStick it to the man because the man don't own your face\n\nGrow a 'stache and a beard and\nMove out to the woods\nDo the H.D. Thoreau thing and start feeling good\nDisconnect the phones and sever all the credit cards\n\nYou say they're not much different than me\nI disagree. They're buying 200-dollar designer jeans\nThey drink martinis. I can't afford a shot of whiskey\nThe joke's on everyone but me\n\nYou wake up every day, and you go to that job interview. But before you go to your job interview, you shave off your beard. And you know what happens when you shave off your beard? 10 kids die in third world countries. 15 kids die in communist countries. and 20 kids die in socialist countries. Don't conform to Gilette. Don't conform to Schick. Don't conform to the Mach 3 Turbo. Don't conform to the Venus. Don't conform to the Mach 3, Don't conform to the Mach 3\n\nMY BEARD OF DEFIANCE!\nMY BEARD OF DEFIANCE!\nMY BEARD OF DEFIANCE!\nMY BEARD OF DEFIANCE!\n\nAnd then when you wake up in the morning and you go into work and your friends say 'that's a shitty beard,' you say, 'fuck you! you're a shitty fucking... non-beard-having...\n\nMY BEARD OF DEFIANCE!\nMY BEARD OF DEFIANCE!\nMY BEARD OF DEFIANCE!\nMY BEARD OF DEFIANCE!\nTAKE BACK THE BEARD! TAKE BACK THE WORLD!\n",
        "explanation": "Unless you live and work in Williamsburg (or Park Slope I guess) or you're in a successful indie/math rock band that does not need to has real jobs, I truly feel that growing a beard is a very rebellious act, it's the spikes and hair dye for twenty-somethings. Let me tell ya, if you're a guy, you can grow some kind of beard once you hit your early twenties. Even if you don't have much facial hair, you can grow something. It'll look like shit for a while sometimes: when I grow a beard it looks awful until about a month in. But then one day you'll wake up and see \"holy fuck! I have a beard!\" Now, as for the rest of the world, they don't really like beards. If you're going to a job interview, you should shave off your beard if you want the job. If you're going out to meet ladies at a club, you should shave off your beard. Isn't that ridiculous? You'll know your true friends if they stick with you while growing a beard! With that said, this song was nothing more than an attempt to write the greatest breakdown in recent hardcore history, something to challenge \"Sunshine The Werewolf\" by Dillinger Escape Plan, and we will play it loud until spin kicks happen. As far as the lyrics go, it's difficult to take beards seriously as a listener. I bet it's also difficult to take a line like \"Stick it to the man, because the man don't own your face\" seriously. But come on, there's SOME truth in there, right?",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-brian-wilson-says-smile-aka-beard-of-defiance-lyrics"
      },
      {
        "orderIndex": 8,
        "name": "Syke! Life Is Awesome!",
        "youtubeUrl": "https://www.youtube.com/embed/u1-pdsOZoCI",
        "lyrics": "I sat along the rocks and watch the cold Maine water rush away\nThe sun and my guitar and I knew what you were doing yesterday\nYou broke those promises but I'll get over it\n'Cause as long as I'm breathing fresh air I really don't give a shit\nBut I'll get mad for the next ten years, but realize that sometimes things are great\n\nI didn't have directions and I hadn't eaten anything all day\nWe sucked a fat one and wasted a hundred dollars just to play\nI ate a bag of peanuts before the windy road\nAnd I couldn't drink a thing all night because of the vomit in my throat\nBut you gave me your sweatshirt and your number, sometimes things are great\n\nYou don't own me! You don't own me!\n\nI worked my ass off my entire life to accomplish my dream\nIt started happening and everything got bastardized by greed\nI said \"pull this shit over and let me out\nI swear to fucking God I'm fucking giving up right now\"\nAnd now I've got a brand new start and I realized sometimes things are great\n\nScream it in apartment halls -\nScreaming shit in shopping malls -\nTake a ball point pen and paint the inside's of your eyelids with the constant reminder:\nYou don't own me. You don't own me\n\nThen I was underground without food, sunlight, or encouragement\nDepression set in, I was a product of my environment\nAnd then the other day, you said, “Jeff, get in your car\nYeah, pick Glenn Tillbrook up at the hotel and take him to the bar.”\nHe wore a t-shirt just like me and wasn't on his phone\nAnd for fifteen fucking minutes I had a conversation with my hero\nI'll be mad for the next ten years\nAnd after that we'll go drink beers until the bar runs out of beers\nPrepare for the next twenty-three years\n\nAnd if I wasn't a fat kid in high school\nI would have never listened to punk rock\nAnd if I knew how to throw a football\nI would have never played any music\nAnd if I never got my heart broken\nI would sing \"blah blah fucking nothing.\"\nAnd if you didn't fuck my ex-girlfriend\nI would still owe you three-thousand dollars\nAnd if I never lived in that van\nI wouldn't have met Chris or Steve or James, Alex or Middagh\nAnd if I never worked in a basement\nI would have never quit my job\nAnd if I had a big emo band or dropped out of college\nI would have never met you, man\n",
        "explanation": "This song took forever because I really wanted to capture the themes from the beginning of the album and implement them in a way that didn't sound forced but also didn't sound predictable. I had at least a dozen A B A' B B' C A structure patterns written down for it, always wanting to do more but being painfully well aware that if a song is longer than four minutes it better HAVE to be longer than four minutes. Cutting out a lot of the repitition in verses and vocal patterns and stuff really seemed to take away from how I wanted the song to build, and finding the right place to put the themes in proved to be a pain in the ass. So I tried it a bunch of different ways, and eventually I just cut a little bit of junk out so it kinda sounds like 20-second blasts of different genres whether it be alt-country, post-punk, reggae or synth pop. I dig it. There are one or two REALLY bad punches in this mix that jump out at me every time I listen to it, and I really should have caught them earlier and fixed them but I was so happy to have this thing done. The song was about how I was fed up with wasting my time in my shitty town with my shitty job. Then one day, Glenn Tillbrook played at my club and I volunteered to pick him up. He hung up his phone when he got in my car, we talked about my old band, his old band, the music industry, my ideas for Bomb the Music Industry! and a bunch of other stuff. When you talk to the guy who wrote \"Pulling Mussels From A Shell\" and he turns out to be a cool dude who is a lot like you and your friends, you kinda realize that life isn't always shitty. I thought about a couple of moments in the past few years that I wouldn't trade for any amount of money, success or freedom and figured, fuck, I guess I'll write ONE song that isn't all whine and no dine.",
        "explanationUrl": "http://quoteunquoterecords.com/qur004.htm",
        "geniusUrl": "https://genius.com/Bomb-the-music-industry-syke-life-is-awesome-lyrics"
      }
    ]
  },
  {
    "orderIndex": 1,
    "name": "We Cool?",
    "bandAbbrv": "jr",
    "year": 2015,
    "ep": false,
    "songs": [
      {
        "orderIndex": 1,
        "name": "Get Old Forever",
        "youtubeUrl": "https://www.youtube.com/embed/4Hc3uVUgzIU"
      },
      {
        "orderIndex": 2,
        "name": "You, In Weird Cities",
        "youtubeUrl": "https://www.youtube.com/embed/TylMST0xVDw"
      },
      {
        "orderIndex": 3,
        "name": "Novelty Sweater",
        "youtubeUrl": "https://www.youtube.com/embed/-YMDx--Foag"
      },
      {
        "orderIndex": 4,
        "name": "Nausea",
        "youtubeUrl": "https://www.youtube.com/embed/Y0CLzbUV-eo"
      },
      {
        "orderIndex": 5,
        "name": "Beers Again Alone",
        "youtubeUrl": "https://www.youtube.com/embed/6R3tDkViwiE"
      },
      {
        "orderIndex": 6,
        "name": "I'm Serious, I'm Sorry",
        "youtubeUrl": "https://www.youtube.com/embed/JPzLB8BrZqY"
      },
      {
        "orderIndex": 7,
        "name": "Hey Allison!",
        "youtubeUrl": "https://www.youtube.com/embed/P6QfNA6do6U"
      },
      {
        "orderIndex": 8,
        "name": "Polar Bear Or Africa",
        "youtubeUrl": "https://www.youtube.com/embed/1ecYe0wiidc"
      },
      {
        "orderIndex": 9,
        "name": "Hall Of Fame",
        "youtubeUrl": "https://www.youtube.com/embed/CcILGVVscEY"
      },
      {
        "orderIndex": 10,
        "name": "All Blissed Out",
        "youtubeUrl": "https://www.youtube.com/embed/jOoVvnpEswQ"
      },
      {
        "orderIndex": 11,
        "name": "The Lows",
        "youtubeUrl": "https://www.youtube.com/embed/6BF6QYFE1lU"
      },
      {
        "orderIndex": 12,
        "name": "Darkness Records",
        "youtubeUrl": "https://www.youtube.com/embed/LyAH0Eo6Kys"
      }
    ]
  },
  {
    "orderIndex": 2,
    "name": "Worry.",
    "bandAbbrv": "jr",
    "year": 2016,
    "ep": false,
    "songs": [
      {
        "orderIndex": 1,
        "name": "We Begged 2 Explode",
        "youtubeUrl": "https://www.youtube.com/embed/4Hc3uVUgzIU"
      },
      {
        "orderIndex": 2,
        "name": "Pash Rash",
        "youtubeUrl": "https://www.youtube.com/embed/TylMST0xVDw"
      },
      {
        "orderIndex": 3,
        "name": "Festival Song",
        "youtubeUrl": "https://www.youtube.com/embed/-YMDx--Foag"
      },
      {
        "orderIndex": 4,
        "name": "Staring Out the Window At Your Old Apartment",
        "youtubeUrl": "https://www.youtube.com/embed/Y0CLzbUV-eo"
      },
      {
        "orderIndex": 5,
        "name": "Wave Goodnight to Me",
        "youtubeUrl": "https://www.youtube.com/embed/6R3tDkViwiE"
      },
      {
        "orderIndex": 6,
        "name": "To Be a Ghost...",
        "youtubeUrl": "https://www.youtube.com/embed/JPzLB8BrZqY"
      },
      {
        "orderIndex": 7,
        "name": "Pietro, 60 Years Old",
        "youtubeUrl": "https://www.youtube.com/embed/P6QfNA6do6U"
      },
      {
        "orderIndex": 8,
        "name": "I Did Something Weird Last Night",
        "youtubeUrl": "https://www.youtube.com/embed/1ecYe0wiidc"
      },
      {
        "orderIndex": 9,
        "name": "Blast Damage Days",
        "youtubeUrl": "https://www.youtube.com/embed/CcILGVVscEY"
      },
      {
        "orderIndex": 10,
        "name": "Bang on the Door",
        "youtubeUrl": "https://www.youtube.com/embed/jOoVvnpEswQ"
      },
      {
        "orderIndex": 11,
        "name": "Rainbow",
        "youtubeUrl": "https://www.youtube.com/embed/6BF6QYFE1lU"
      },
      {
        "orderIndex": 12,
        "name": "Planet Luxury",
        "youtubeUrl": "https://www.youtube.com/embed/LyAH0Eo6Kys"
      },
      {
        "orderIndex": 13,
        "name": "June 21st",
        "youtubeUrl": "https://www.youtube.com/embed/LyAH0Eo6Kys"
      },
      {
        "orderIndex": 14,
        "name": "The Fuzz",
        "youtubeUrl": "https://www.youtube.com/embed/LyAH0Eo6Kys"
      },
      {
        "orderIndex": 15,
        "name": "...While You're Alive",
        "youtubeUrl": "https://www.youtube.com/embed/LyAH0Eo6Kys"
      },
      {
        "orderIndex": 16,
        "name": "Perfect Sound Whatever",
        "youtubeUrl": "https://www.youtube.com/embed/LyAH0Eo6Kys"
      }
    ]
  },
  {
    "orderIndex": 3,
    "name": "SKA DREAM",
    "bandAbbrv": "jr",
    "year": 2021,
    "ep": false,
    "songs": [
      {
        "orderIndex": 1,
        "name": "NO TIME TO SKANK",
        "youtubeUrl": "https://www.youtube.com/embed/Tw1xp7-T1M0"
      },
      {
        "orderIndex": 2,
        "name": "Airwalks (Alt)",
        "youtubeUrl": "https://www.youtube.com/embed/nevepXR0MeI"
      },
      {
        "orderIndex": 3,
        "name": "SKrAm!",
        "youtubeUrl": "https://www.youtube.com/embed/eim0fVh5AZE"
      },
      {
        "orderIndex": 4,
        "name": "S K A D R E A M",
        "youtubeUrl": "https://www.youtube.com/embed/O8pf7jn_Jo8"
      },
      {
        "orderIndex": 5,
        "name": "Horn Line",
        "youtubeUrl": "https://www.youtube.com/embed/hvnn0ZSKEvQ"
      },
      {
        "orderIndex": 6,
        "name": "p i c k i t u p",
        "youtubeUrl": "https://www.youtube.com/embed/CXgBYiBK6nI"
      },
      {
        "orderIndex": 7,
        "name": "Leave It In The Ska",
        "youtubeUrl": "https://www.youtube.com/embed/OFozTxgGeQQ"
      },
      {
        "orderIndex": 8,
        "name": "The Rudie Of Breathing",
        "youtubeUrl": "https://www.youtube.com/embed/B3rS3z_FU68"
      },
      {
        "orderIndex": 9,
        "name": "Old SKrAp",
        "youtubeUrl": "https://www.youtube.com/embed/nI771zFZJyw"
      },
      {
        "orderIndex": 10,
        "name": "***SKA",
        "youtubeUrl": "https://www.youtube.com/embed/6SixWNVc8aQ"
      },
      {
        "orderIndex": 11,
        "name": "Monday At Back To The Beach",
        "youtubeUrl": "https://www.youtube.com/embed/0a9NpWHWF6g"
      },
      {
        "orderIndex": 12,
        "name": "Checkerboard Ashtray",
        "youtubeUrl": "https://www.youtube.com/embed/QVXaR2Fh9LY"
      },
      {
        "orderIndex": 13,
        "name": "Ohio Porkpie",
        "youtubeUrl": "https://www.youtube.com/embed/UqdsmEn4WcI"
      }
    ]
  },
  {
    "orderIndex": 1,
    "name": "Love in the Time of Email",
    "bandAbbrv": "av",
    "year": 2018,
    "ep": false,
    "songs": [
      {
        "orderIndex": 1,
        "name": "Voicemail",
        "youtubeUrl": "https://www.youtube.com/embed/pbvFFOwnEnQ"
      },
      {
        "orderIndex": 2,
        "name": "Kimmy",
        "youtubeUrl": "https://www.youtube.com/embed/i5dwk1g6aGQ"
      },
      {
        "orderIndex": 3,
        "name": "White Noise",
        "youtubeUrl": "https://www.youtube.com/embed/NdIRL4vHD1w"
      },
      {
        "orderIndex": 4,
        "name": "Breathless On DVD",
        "youtubeUrl": "https://www.youtube.com/embed/8c-dkLJ-PQg"
      },
      {
        "orderIndex": 5,
        "name": "The Price is Right Theme Song",
        "youtubeUrl": "https://www.youtube.com/embed/tPq7aWeH2K4"
      },
      {
        "orderIndex": 6,
        "name": "So Vivid!",
        "youtubeUrl": "https://www.youtube.com/embed/diL_-AKV1Ho"
      },
      {
        "orderIndex": 7,
        "name": "Freakin' U Out",
        "youtubeUrl": "https://www.youtube.com/embed/-Okhy74Y_Pw"
      },
      {
        "orderIndex": 8,
        "name": "All These Nights",
        "youtubeUrl": "https://www.youtube.com/embed/x2XvzwaMadY"
      },
      {
        "orderIndex": 9,
        "name": "Not Yours",
        "youtubeUrl": "https://www.youtube.com/embed/zAwEPihU7FY"
      },
      {
        "orderIndex": 10,
        "name": "Do It Over",
        "youtubeUrl": "https://www.youtube.com/embed/bnaNnWGwYH8"
      },
      {
        "orderIndex": 11,
        "name": "Another Good Thing",
        "youtubeUrl": "https://www.youtube.com/embed/T_XQGM6ZZaY"
      },
      {
        "orderIndex": 12,
        "name": "Lifelike",
        "youtubeUrl": "https://www.youtube.com/embed/sJu4l2A5zTw"
      },
      {
        "orderIndex": 13,
        "name": "Email",
        "youtubeUrl": "https://www.youtube.com/embed/8NE4XqXRiDI"
      }
    ]
  }
]