[
  {
    "orderIndex": 1,
    "name": "The Arrogant Sons of Bitches",
    "bandAbbrv": "asob",
    "bandMembers": [
      "Jeff Rosenstock",
      "John DeDominici",
      "Chris Baltrus",
      "Mike Costa",
      "JT Turret"
    ],
    "description": "The Arrogant Sons of Bitches was a ska-punk band that emerged from Long Island, New York, in the late 1990s. The band was founded by musician Jeff Rosenstock in 1995 as a solo project during his high school years. The project soon evolved into a full-fledged band, drawing influences from ska, punk, and other genres. With a distinctive blend of energetic ska rhythms, punk rock sensibilities, and socially conscious lyrics, they quickly gained a loyal local following.\n\nThroughout their active years, spanning from the late 1990s to the mid-2000s, The Arrogant Sons of Bitches released several albums, EPs, and singles. Their music was characterized by its catchy melodies, energetic performances, and thought-provoking lyrics that often touched on themes of political awareness, personal struggles, and social commentary. The band's lineup underwent changes over the years, but their music consistently retained its fervent spirit and creative edge.\n\nWhile not achieving mainstream commercial success, The Arrogant Sons of Bitches left a lasting impact on the ska-punk and DIY music scenes. They are remembered for their passionate live shows and their contribution to the underground punk community. Furthermore, the band's founder, Jeff Rosenstock, went on to establish a successful solo career and formed the band \"Bomb the Music Industry!\" which also made waves in the punk and indie scenes. The Arrogant Sons of Bitches' legacy lives on through their influence on subsequent generations of musicians who continue to draw inspiration from their genre-blending sound and unapologetic approach to music and activism.",
    "albums": [
      {
        "orderIndex": 1,
        "name": "Built To Fail",
        "bandAbbrv": "asob",
        "year": 1998,
        "ep": false
      },
      {
        "orderIndex": 2,
        "name": "Pornocracy",
        "bandAbbrv": "asob",
        "year": 2000,
        "ep": false
      },
      {
        "orderIndex": 3,
        "name": "The Apology",
        "bandAbbrv": "asob",
        "year": 2001,
        "ep": true
      },
      {
        "orderIndex": 4,
        "name": "All The Little Ones Are Rotting",
        "bandAbbrv": "asob",
        "year": 2002,
        "ep": true
      },
      {
        "orderIndex": 5,
        "name": "This Is What You Get",
        "bandAbbrv": "asob",
        "year": 2003,
        "ep": false
      },
      {
        "orderIndex": 6,
        "name": "Three Cheers For Disappointment",
        "bandAbbrv": "asob",
        "year": 2006,
        "ep": false
      }
    ]
  },
  {
    "orderIndex": 2,
    "name": "Bomb The Music Industry!",
    "bandAbbrv": "btmi",
    "bandMembers": [
      "Jeff Rosenstock",
      "John DeDominici",
      "Chris Baltrus",
      "Mike Costa",
      "JT Turret"
    ],
    "description": "Bomb the Music Industry! was a punk rock and indie rock collective founded by musician Jeff Rosenstock. The band emerged in 2004 with a unique DIY ethos, rejecting traditional industry norms. Jeff Rosenstock, the driving force behind the group, began his musical journey in the ska-punk band The Arrogant Sons of Bitches. However, it was with Bomb the Music Industry! that Rosenstock truly made his mark as a versatile and influential artist.\n\nRosenstock's vision for Bomb the Music Industry! was rooted in a commitment to independence and creative freedom. The band embraced a model where they gave away their music for free, challenging the established conventions of the music industry. This approach not only garnered attention but also built a dedicated fanbase drawn to the authenticity and sincerity of Rosenstock's lyrics. The band's discography reflects an evolution of sound, incorporating elements of punk, ska, and indie rock, showcasing Rosenstock's ability to navigate diverse musical landscapes.\n\nOver the years, Bomb the Music Industry! became known for their energetic live performances and socially conscious lyrics. Jeff Rosenstock's journey with the band encapsulates a resilient spirit and an unwavering dedication to artistic expression outside the confines of mainstream expectations. As the frontman and creative force, Rosenstock's impact on the punk and indie scenes remains significant, leaving behind a legacy of innovation and a testament to the power of staying true to one's artistic vision.",
    "albums": [
      {
        "orderIndex": 1,
        "name": "Album Minus Band",
        "year": 2005,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "To Leave or Die in Long Island",
        "year": 2005,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "Goodbye Cool World",
        "year": 2006,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "Get Warmer",
        "year": 2007,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "Scrambles",
        "year": 2009,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "Adults!!!: Smart!!! Shithammered!!! And Excited By Nothing!!!!!!!",
        "year": 2010,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "Vacation",
        "year": 2011,
        "ep": false
      }
    ]
  },
  {
    "orderIndex": 3,
    "name": "Jeff Rosenstock",
    "bandAbbrv": "jr",
    "bandMembers": [
      "Jeff Rosenstock",
      "John DeDominici",
      "Mike Huguenor",
      "Kevin Higuchi"
    ],
    "description": "Jeff Rosenstock's solo career has marked a significant chapter in the musician's journey, showcasing his prowess as a singer, songwriter, and producer. Following the disbandment of Bomb the Music Industry!, Rosenstock embarked on a solo venture that has earned him critical acclaim for his raw, emotionally charged performances and socially conscious lyrics. Under his own name, Jeff Rosenstock has become synonymous with a brand of punk rock that is both introspective and outwardly aware.\n\nRosenstock's solo discography is characterized by a sense of urgency and authenticity, often tackling contemporary social and political issues. His debut solo album, \"I Look Like Shit\" (2012), and subsequent releases like \"Worry\" (2016) and \"POST-\" (2018) showcase a sonic evolution, incorporating elements of ska, punk, indie rock, and folk. Jeff Rosenstock's ability to seamlessly blend genres and deliver poignant narratives has resonated with a diverse audience, earning him a reputation as a formidable force in the contemporary punk scene.\n\nBeyond the music itself, Jeff Rosenstock's solo work reflects a commitment to DIY ethics and the idea that music can be a powerful vehicle for self-expression and societal critique. His energetic live performances and approachable persona have endeared him to fans around the world, solidifying Jeff Rosenstock as a pivotal figure in the punk and indie music landscape, and further establishing his legacy as a versatile and influential artist.",
    "albums": [
      {
        "orderIndex": 1,
        "name": "I Look Like Shit",
        "year": 2012,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "We Cool?",
        "year": 2015,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "Worry.",
        "year": 2016,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "POST-",
        "year": 2018,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "NO DREAM",
        "year": 2020,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "SKA DREAM",
        "year": 2021,
        "ep": false
      },
      {
        "orderIndex": 1,
        "name": "HELLMODE",
        "year": 2023,
        "ep": false
      }
    ]
  },
  {
    "orderIndex": 4,
    "name": "Antarctigo Vespucci",
    "bandAbbrv": "av",
    "bandMembers": [
      "Jeff Rosenstock",
      "Chris Farren"
    ],
    "description": "Antarctigo Vespucci is a collaborative musical project formed by Jeff Rosenstock, the former frontman of Bomb the Music Industry!, and Chris Farren, a singer-songwriter and founding member of the punk band Fake Problems. The duo joined forces to create a distinctive blend of punk, indie rock, and power pop. The project took its name from the 16th-century Italian explorer Amerigo Vespucci, adding a quirky and imaginative touch to their musical endeavors.\n\nThe collaboration between Rosenstock and Farren in Antarctigo Vespucci brought forth a dynamic synergy, showcasing their individual talents and shared passion for crafting infectious, melodic tunes. The band's discography is characterized by catchy hooks, witty lyrics, and a sense of camaraderie between the two musicians. Antarctigo Vespucci's music often explores themes of love, friendship, and the complexities of the human experience, creating a relatable and engaging sonic landscape.\n\nDespite not being as widely recognized as some mainstream acts, Antarctigo Vespucci has garnered a dedicated fanbase that appreciates the authenticity and creativity embedded in their work. Jeff Rosenstock's continued commitment to pushing musical boundaries, coupled with Chris Farren's songwriting prowess, has solidified Antarctigo Vespucci as a noteworthy project in the alternative music scene, further showcasing Rosenstock's versatility as an artist beyond his earlier endeavors with Bomb the Music Industry!.",
    "albums": [
      {
        "orderIndex": 1,
        "name": "Soulmate Stuff",
        "year": 2014,
        "ep": true
      },
      {
        "orderIndex": 2,
        "name": "I'm So Tethered",
        "year": 2014,
        "ep": true
      },
      {
        "orderIndex": 3,
        "name": "Leavin' La Vida Loca",
        "year": 2015,
        "ep": false
      },
      {
        "orderIndex": 4,
        "name": "Love In The Time Of E-Mail",
        "year": 2018,
        "ep": false
      }
    ]
  }
]